{
	"commandTitle.favorites": "Path Maker - Favorites",
	"commandTitle.history": "Path Maker - History",
	"commandTitle.workspace": "Path Maker - Show Workspace Directory",

	"baseDirectory": "**You don't have to set this. It's used internally.** When the base directory set, it will be stored in this value.",
	"groupDirectories": "Display directories and files separately.",
	"showDirectoryIcons": "Show directory icons.",
	"showHiddenFiles": "Show hidden files.",
	"startDirectory": "The first directory to be displayed when the command is executed.",
	"startDirectory.lastDirectory": "The last displayed directory. If there is no last displayed directory, it will be the workspace directory, or the directory of the editing file, or the user's home directory.",
	"startDirectory.workspaceDirectory": "Workspace directory. If the workspace directory is not found, the directory of the editing file is used. If the editing file is not found, the home directory is used.",
	"startDirectory.editingFileDirectory": "Editing file's directory. If the editing file is not found, the home directory is used.",
	"startDirectory.userDirectory": "User's home directory.",
	"lastDirectory": "**You don't have to set this. It's used internally.** When `StartDirectory` is `Last`, this value is used.",
	"defaultAction": "The action when the file is selected.",
	"defaultAction.menu": "Show the menu and select an action.",
	"defaultAction.open": "Open the file in editor.",
	"defaultAction.copy": "Copy file path to clipboard.",
	"defaultAction.editor": "Insert file path to active editor.",
	"defaultAction.terminal": "Insert file path to active terminal.",
	"defaultAction.reveal": "Reveal file in the File Explorer or Finder.",
	"hideUserName": "Mask the directory name of the user name in the pathes.",
	"hiddenUserNameAlternative": "The text shown when `hideUserName` is set to `true`.",
	"pinnedList": "**You don't have to set this. It's used internally.** List of files/directories that are pinned. Delete this value if you want to clear all the pinned list.",
	"favoriteList": "**You don't have to set this. It's used internally.** List of files/directories that are favorite. Delete this value if you want to clear all the favorite list.",
	"recentList": "**You don't have to set this. It's used internally.** List of recently used files/directories. Delete this value if you want to clear all history.",
	"showRelativeRoute": "Displays the directories along the path from the base directory (or root directory in case of absolute path display).",
	"pathPresentation": "Path display format.",
	"pathPresentation.relative": "Display as a relative path from the base directory.",
	"pathPresentation.absolute": "Display as an absolute path.",
	"itemButtonVisibility": "Buttons displayed to the right of each item.",
	"itemButtonVisibility.Copy": "Button to copy the path to clipboard",
	"itemButtonVisibility.InsertToEditor": "Button to insert the path into active editor",
	"itemButtonVisibility.InsertToTerminal": "Button to insert the path into active terminal",
	"itemButtonVisibility.OpenInEditor": "Button to open the file in editor",
	"itemButtonVisibility.RevealInShell": "Button to reveal in Explorer",
	"itemButtonVisibility.OpenAsWorkspace": "Button to open directory as workspace",
	"itemButtonVisibility.OpenAsWorkspaceInNewWindow": "Button to open directory as workspace in a new window",
	"itemButtonVisibility.Pin": "Button to pin to the quick access",
	"itemButtonVisibility.Favorite": "Button to add to the favorites",
	"maxDirectories": "Max number of directories to display. This is to prevent the list from becoming too long. The remaining directories can be viewed by selecting 'Show remaining directories'. Set to 0 to display all directories from the start. This setting is only effective when directories and files are displayed separately.",
	"maxFiles": "Max number of files to display. This is to prevent the list from becoming too long. The remaining files can be viewed by selecting 'Show remaining files'. Set to 0 to display all files from the start. This setting is only effective when directories and files are displayed separately.",
	"maxDirectoriesAndFiles": "Max number of directories and files to display. This is to prevent the list from becoming too long. The remaining items can be viewed by selecting 'Show remaining items'. Set to 0 to display all items from the start. This setting is only effective when directories and files are displayed together.",
	"description.ignoreInvalidPaths": "Hide invalid paths (paths that don't exist or have inaccessible file information)."
}